if (!window.autoi18n) window.autoi18n = {};
window.autoi18n['KO'] = {
    "showText": {
        "cjfjtips": "방을 만드는 정보를 입력하세요",
        "rssrtips": "플레이어 수는 2-20입니다",
        "jrsrtips": "금액 입력 오류,  최소로 10보다 적을수 없습니다",
        "sjsrtips": "재생 시간은 1-3 분입니다",
        "czerrortips": "조작 오류",
        "ssfjbcztips": "검색한 방이 존재하지 않습니다",
        "myhytips": "당신은 아직 친구가 없습니다",
        "hqhylbtips": "리스트 획득 실패",
        "fsyqxxsustips": "초대 정보 발송 성공",
        "xzyqhytips": "초대할 친구를 선택하세요",
        "wldktips": "인터넷 연결 실패, 다시 연결하세요..",
        "fhbnwktips": "방 번호를 비워둘수 없습니다",
        "ssmmjrtips": "비밀번호를 입력한후 입장하세요",
        "zhwjtc": "마지막 게이머가 퇴장했고 방은 곧 해산됩니다.",
        "qdtcyx": "게임을 나가겠습니까?",
        "xtydj": "시스템이 이미 동결되었습니다",
        "bkxyyfz":"게임 시간이 1분보다 적을수 없습니다",
		"jhts":"귀하의 계정은 다른 곳에 로그인되어 있습니다",
        "zhunbeizhong":"준비중",
        "youxizhong":"게임에서",
    },
    "serverTips":{
        "Lang10001": "당신은 이미 {0}호 방에 입장하였고 방을 만들수 없습니다",
        "Lang10002": "당신은 이미 {0}호 방에 입장하였습니다",
        "Lang10003": "방 비밀번호 오류",
        "Lang10004": "방 인수가 이미 찼습니다",
        "Lang10005": "방 인수가 이미 찼고 게임이 이미 시작되었습니다~",
        "Lang10006": "사용자 정보 획득에 실패하였고 다시 로그인하세요~",
        "Lang10007": "게임이 이미 시작되었습니다",
        "Lang10008": "우선 방에 입장하세요",
        "Lang10009": "준비되었고 게임이 시작되기를 기다리세요~",
        "Lang10011": "사용자 정보 획득에 실패하였고 다시 로그인하세요~",
        "Lang10012": "ALSC화폐 잔액 부족~",
        "Lang10013": "게임에서 나갈수 없습니다",
        "Lang10014": "게임이 이미 끝났습니다",
        "Lang10015": "이 광석은 이미 다른 게이머가 발굴했습니다",
        "Lang10016": "이 광석은 이미 다른 게이머가 빼앗았습니다",
        "Lang10017": "방 주인만 방을 해산할수 있습니다~",
        "Lang10018": "게임이 이미 시작되었고 방을 해산할수 없습니다~",
        "Lang10019": "이 방은 없습니다~",
        "Lang10020": "방이 존재하지 않고 다시 시도하세요~",
        "Lang10021": "연결 오류",
        "Lang10022": "링크 정보 오류",
        "Lang10023": "방 인수는 반드시 2-20사이여야 합니다",
        "Lang10024": "10단주 금액은 최소로 10입니다",
        "Lang10025": "게임 시간은 반드시 1분이상이어야 합니다",
        "Lang10026": "남은 방이 없습니다~잠시만 기다리세요",
        "Lang10027": "광석 파라미터 오류",
        "Lang10028": "게임 결제 이상",
    },

    "inviteText": {
        "sdyqxx": "收到邀请信息",
    },

    "HallScene": {
        "hallUI.text_RoomList": "방 리스트",
        "RoomListIcon.headicondi.l_fangzhu": "방주인",
        "RoomListIcon.i_danzhu": "단주：",
        "RoomListIcon.i_wanjia": "게이머：",
        "RoomListIcon.i_fanghao": "방번호：",
    },

    "GameScene": {
        "upNode.leftdi.nicheng": "별칭：",
        "upNode.leftdi.defen": "득점：",
		"upNode.leftdi.paiming": "랭킹：",
        "upNode.rightdi.fanghao": "방번호：",
		"upNode.rightdi.wanjia": "플레이어：",
        "bjyxhd": "이번 게임에서 당신이 획득한것은",
    },

    "CreateRoom": {
        "label_password": "게임 인수",
        "label_renshu": "게임 시간",
        "label_time": "단주 금액",
        "label_jine": "방 비밀번호",
        "label_tips": "방을 만들려면 동결해야 합니다",
        "EditBoxRenshu.label_ren": "명",
        "EditBoxTime.label_fen": "점",
        "EditBoxRenshu.PLACEHOLDER_LABEL": "최소 2 명",
        "EditBoxTime.PLACEHOLDER_LABEL": "최소 1 분, 최대 3 분",
        "EditBoxJine.PLACEHOLDER_LABEL": "최소 10 ALSC",
        "EditBoxMima.PLACEHOLDER_LABEL": "입력하지 않아도 됨",
    },

     "GameRule": {
        "1" : 
        `1、어떻게 방을 만드는가?

        플레이어는 성공적으로 로그인한 후 아래측에 있는 세번째 버튼을 클릭합니다.그리고 맨 위쪽에 있는 “전 국민이 광산을 발굴하여 사람을 기다려 전쟁을 하다”를 클릭하면 게임 화면으로 들어옵니다.그리고 왼쪽 아래에 있는 “방 만들기” 버튼을 클릭하면 방 만들기 관련 화면이 나타나는데 관련 메세지를 작성해야 합니다.”게임 인원수”는 최소 2명부터 최대 20명까지 가능하며, ”게임 시간”은 1분보다 길어야 하고 상한이 없으며 반드시 정수를 입력하여야 하며, “단주 금액”은 최저 10매의 ALSC에서 상한이 없으며, 방에 들어온 모든 유저는 방을 만들 때 설정한 ALSC가 동결됩니다
        게임 시작 전에 방에서 나가면 시스템은 동결된ALSC를 반환합니다. 게임이 종료되면 플레이어들의 랭킹에 따라 점수가 제일 낮은 플레이어의 단주 금액을 나눕니다.만약 점수가 같으면 합해서 나누고 기타 플레이어의 동결된 단주 금액은 자동으로 반환됩니다. 
        ALSC가 부족하면 방을 만들 수 없고 방에 들어갈 수도 없습니다. ”방 비밀번호”은 선택 기입 항목인데 만약 방을 만들 때 비밀번호를 입력하였다면 다른 플레이어들이 이 방에 들어갈 때도 비밀번호를 입력하여야 합니다.모든 메세지를 작성한 후 “바로 만들기 ”버튼을 클릭하면 성공적으로 방이 만들어집니다.
        방 유형은 공공방과 비밀번호방이 있는데 공공방은 모든 플레이어들이 들어갈 수 있는 방이고 비밀번호방은 비밀번호를 입력하여야 들어갈 수 있는 방입니다.성공적으로 방을 만든 후 화면의 맨 위쪽에 “홀로 돌아가기” 버튼,  “게임 룰” 버튼, “플레이어 검색”버튼, “친구 초대” 버튼이 있고 아래쪽에는 플레이어의 득점,닉네임, ALSC,방 번호 등 메세지가 있습니다.
        `,


        "2" : 
        `2、어떻게 친구를 초대하는가?
        
        방을 만든 후 화면의 위쪽에 있는 4번째 버튼이 “친구 초대”버튼입니다. 이것을 클릭하면 친구 초대 화면이 나타나는데 친구의 상태(게임중,대기중,오프라인)를 확인할 수 있고 초대하고 싶은 친구를 선택하여 바로 초대하기 버튼을 클릭하면 됩니다. 초대 받은 친구는 방에 들어올 수 있고 준비 버튼 아래에서 친구의 정보를 확인할 수 있습니다.대기중이거나 오프라인 상태인 친구만 초대할 수 있습니다.
        `,


        "3" :
        `3、어떻게 방에 들어오는가?
        
        성공적으로 로그인한 후 아래쪽에 있는 세번째 버튼을 클릭하고 위쪽의 “전 국민이 광산을 발굴하여 사람을 기다려 전쟁을 하다”를 클릭하면 게임 화면으로 들어옵니다. ”방 리스트 화면”에서 “방 상태”, ”방 번호”, “플레이어 인원수”, “단주 금액”, “공개방’,  “비밀번호방”등과 같은 방 정보를 확인할 수 있습니다.
        “방 리스트” 우측의 “방 검색”버튼을 클릭하고 방 번호를 입력한 후 바로 들어가기를 클릭하면 방에 들어갈 수 있습니다.방 정보에 있는 “바로 들어가기”버튼을 클릭하여 방에 들어가거나 아래쪽에 있는 “랜덤 입장” 버튼을 클릭하여 곧 게임을 시작하는 방에 들어갈 수 있습니디.게임중인 방에는 들어갈 수 없으며 방에 들어간 후 시스템은 자동으로 방을 만들 때 입력한 단주 금액을 동결하고 게임이 종료되면 결산을 진행합니다.
        `,

        "4" :
        `4、어떻게 게임을 시작하는가?
        
        방을 만들거나 방에 들어가면 게임 화면이 나타나는데 아래쪽에 있는 “준비” 버튼을 클릭합니다.준비 인원수가 방을 만들 때 입력한 “게임 인원수”의 절반을 초과하면 “준비” 버튼 아래쪽에서 카운트다운을 시작합니다.이때 플레이어는 준비를 취소할 수 없습니다.카운트다운가 끝나면 게임이 시작되고 준비를 안 한 모든 플레이어는 자동으로 쫓겨나게 됩니다.
        예를 들어 방을 만들 때 “게임 인원수”를 10명으로 입력하였다면 5명의 플레이어가 준비를 했을 때 카운트다운를 시작합니다.카운트다운가 끝나면 게임이 시작되고 준비하지 않은 모든 플레이어는 쫒겨나게 됩니다.만약 10명의 플레이어가 모두 준비를 하였다면 바로 게임을 시작합니다.
        `,

        "5" :
        `5、게임을 시작한 후
        
        플레이어는 게임을 시작한 후 위쪽에서 “게임에서 나가기” 버튼, “게임 룰”버튼, ”플레이어 리스트”버튼, “친구 초대” 버튼을 볼 수 있습니다.
        “게임 룰” 버튼을 클릭하면 게임 방법 소개를 보실 수 있습니다. 
        “플레이어 리스트”버튼을 클릭하면 이번 판의 모든 플레이어의 현재 랭킹,득점등 정보를 볼 수 있습니다.
        “친구 초대”버튼을 클릭하면  게임중,대기중,오프라인과 같은 친구의 상태를 확인할 수 있습니다.하지만 이때 친구를 초대하더라도 친구는 방에 들어올 수 없습니다.
        게임 화면의 중간에 금광,돌이 나타나는데 금광을 캐면 1-100사이의 랜덤 점수를 획득할 수 있고 돌을 캐면 점수가 없습니다.만약 많은 플레이어가 동시에 광석을 캤으면 먼저 캔 플레이어가 점수를 획득하고 다른 플레이어는 점수가 없습니다.
        금광과 돌이 3분의 1 남았을 때 새로운 광석이 나타납니다.이때 금광과 돌 아래쪽에서 카운트다운의 형식으로 게임 종료까지 얼마 남았다고 알려주는데 카운트다운 시간은 방을 만들 때 입력한 게임 시간을 기준으로 합니다.카운트다운가 끝나면 게임이 종료됩니다. 예를 들어 플레이어가 전화를 받아30초동안 이야기를 하였더라도 이 기간동안 카운트다운은 멈추지 않습니다.
        맨 아래쪽에서 플레이어의 득점,닉네임, ALSC수량,방 번호 등 정보를 확인할 수 있고 매 플레이어의 닉네임. ALSC수량,현재 득점 정보도 확인할 수 있습니다.
        `,

        "6" :
        `6、게임 종료 후 게임 결산
        
        카운트다운가 끝나면 게임이 종료되면서 결산 화면이 나타납니다.이 화면의 중간 부분에서 이번 판의 플레이어의 랭킹,득점을 확인할 수 있고 시스템은 이 화면의 득점과 랭킹에 의거하여 순위가 제일 낮은 플레이어의 단주 금액(만약 같은 플레이어가 있으면 합해서 나눕니다.)을 나눕니다.순위와 득점이 제일 낮은 플레이어 외 기타 플레이어는 획득한 ALSC에서 일정한 광산 비용을 내야 하고 순위와 득점이 제일 낮은 플레이어 외 기타 플레이어의 단주 금액은 자동으로 계정에 반환됩니다.플레이어는 랭킹과 득점의 아래쪽에서 이번 판에서 획득한 ALSC를 확인할 수 있습니다.
        방에 플레이어가 2명밖에 없고 득점이 같다면 시스템은 계산을 하지 않고 동결된 단주 금액을 반환합니다.
        이번 판에서 획득한ALSC 아래쪽에는 “방에서 나가기”, ”한 판 다시 하기” 버튼이 있습니다. ”방에서 나가기” 버튼을 클릭하면 방 리스트 화면이 나타나고 “한판 다시 하기”버튼을 클릭하면 방 화면으로 돌아와 다시 게임을 시작합니다.매 판의 게임은 모두 방을 만들 때  입력한 단주 금액을 동결하고 게임이 종료되면 결산을 진행 합니다.
        `,

        "7":
        `7、인터넷 연결이 끊긴 후 다시 연결할 때
        
        황금 광부는 인터넷 연결이 끊긴 후 다시 연결하는 기능이 있습니다.플레이어는 전화를 받거나 메시지를 하거나 휴대폰에 전기가 없거나 APP를 나가거나 인터넷이 끊기거나 인터넷이 불안정 현상이 일어날 수 있습니다.다시 로그인을 한 후 다시 연결하기 버튼을 클릭하면 원래의 화면으로 돌아가 계속 게임을 할 수 있습니다.
        그렇지만 인터넷 연결이 끊기고 다시 연결하는데는 시간 제한이 있습니다.연결이 끊겨다고 해도 카운트다운는 중단되지 않고 다시 연결했을 때 만약 카운트다운가 끝나지 않았으면 계속 게임을 할 수 있고 게임이 이미 종료 되었으면 게임 결산 화면으로 넘어갑니다.
        `,

        "8":
        `8、게임 도중 잠시 나갈 경우
        
        게임 도중 잠시 나갈 때는 “게임에서 나가기” 버튼을 클릭하여 “황금 광부” 화면에서 나가 투자 재무 혹은 이체를 할 수 있습니다.그리고 다시 “전 국민이 광산을 발굴하여 사람을 기다려 전쟁을 하다”를 클릭하고 이때 카운트다운이 끝나지 않았으면 게임으로 돌아갈 수 있습니다`
     },

     "GetInvite": {
        "tip": "당신을 게임에 초대합니다"
     },

      "SearchRoom": {
        "fanghaoEditBox.PLACEHOLDER_LABEL": "방 번호를 입력하세요",
        "mimaEditBox.PLACEHOLDER_LABEL": "방 비밀번호를 입력하세요",
     },
}